# Lin Han's MySQL Database Information Extraction Project

## 1. Import packages & Connect to a MySQL database

In [1]:
from sqlalchemy import create_engine, MetaData, Table, select
import pandas as pd

In [2]:
engine = create_engine('mysql+mysqldb://root:Hl960829!@localhost:3306/sql_invoicing') #pip install mysqlclient

In [3]:
connection = engine.connect()

## 2. Check tables' details in the database

In [4]:
# Check table names
print(engine.table_names())

['clients', 'invoices', 'payment_methods', 'payments']

In [5]:
# Initialize a metadata object
metadata = MetaData()

In [6]:
# Use function repr() to view the details of the table 'clients'
for table in engine.table_names():
    table = Table(table, metadata, autoload=True, autoload_with=engine)
    print('\n')
    print(str(table) + ' table details:') 
    print(repr(table))

clients table details:
Table('clients', MetaData(bind=None), Column('client_id', INTEGER(display_width=11), table=<clients>, primary_key=True, nullable=False), Column('name', VARCHAR(length=50), table=<clients>, nullable=False), Column('address', VARCHAR(length=50), table=<clients>, nullable=False), Column('city', VARCHAR(length=50), table=<clients>, nullable=False), Column('state', CHAR(length=2), table=<clients>, nullable=False), Column('phone', VARCHAR(length=50), table=<clients>), schema=None)


invoices table details:
Table('invoices', MetaData(bind=None), Column('invoice_id', INTEGER(display_width=11), table=<invoices>, primary_key=True, nullable=False), Column('number', VARCHAR(length=50), table=<invoices>, nullable=False), Column('client_id', INTEGER(display_width=11), ForeignKey('clients.client_id'), table=<invoices>, nullable=False), Column('invoice_total', DECIMAL(precision=9, scale=2), table=<invoices>, nullable=False), Column('payment_total', DECIMAL(precision=9, scale=2), table=<invoices>, nullable=False, server_default=DefaultClause(<sqlalchemy.sql.elements.TextClause object at 0x00000228447BCFD0>, for_update=False)), Column('invoice_date', DATE(), table=<invoices>, nullable=False), Column('due_date', DATE(), table=<invoices>, nullable=False), Column('payment_date', DATE(), table=<invoices>), schema=None)


payment_methods table details:
Table('payment_methods', MetaData(bind=None), Column('payment_method_id', TINYINT(display_width=4), table=<payment_methods>, primary_key=True, nullable=False), Column('name', VARCHAR(length=50), table=<payment_methods>, nullable=False), schema=None)


payments table details:
Table('payments', MetaData(bind=None), Column('payment_id', INTEGER(display_width=11), table=<payments>, primary_key=True, nullable=False), Column('client_id', INTEGER(display_width=11), ForeignKey('clients.client_id'), table=<payments>, nullable=False), Column('invoice_id', INTEGER(display_width=11), ForeignKey('invoices.invoice_id'), table=<payments>, nullable=False), Column('date', DATE(), table=<payments>, nullable=False), Column('amount', DECIMAL(precision=9, scale=2), table=<payments>, nullable=False), Column('payment_method', TINYINT(display_width=4), ForeignKey('payment_methods.payment_method_id'), table=<payments>, nullable=False), schema=None)

In [7]:
# Get the table's primary key column & all columns
for table in engine.table_names():
    table = Table(table, metadata, autoload=True, autoload_with=engine)
    print('\n')
    print(str(table) + ' table primary key:') 
    print(table.primary_key)
    print(str(table) + ' table columns:') 
    print(table.columns)

clients table primary key:
PrimaryKeyConstraint(Column('client_id', INTEGER(display_width=11), table=<clients>, primary_key=True, nullable=False))
clients table columns:
['clients.client_id', 'clients.name', 'clients.address', 'clients.city', 'clients.state', 'clients.phone']


invoices table primary key:
PrimaryKeyConstraint(Column('invoice_id', INTEGER(display_width=11), table=<invoices>, primary_key=True, nullable=False))
invoices table columns:
['invoices.invoice_id', 'invoices.number', 'invoices.client_id', 'invoices.invoice_total', 'invoices.payment_total', 'invoices.invoice_date', 'invoices.due_date', 'invoices.payment_date']


payment_methods table primary key:
PrimaryKeyConstraint(Column('payment_method_id', TINYINT(display_width=4), table=<payment_methods>, primary_key=True, nullable=False))
payment_methods table columns:
['payment_methods.payment_method_id', 'payment_methods.name']


payments table primary key:
PrimaryKeyConstraint(Column('payment_id', INTEGER(display_width=11), table=<payments>, primary_key=True, nullable=False))
payments table columns:
['payments.payment_id', 'payments.client_id', 'payments.invoice_id', 'payments.date', 'payments.amount', 'payments.payment_method']

## 3. Creat Pandas dataframes from MySQL tables

### 3.1. clients_df:

In [8]:
# Creat clients_df Pandas dataframe and set index to the primary key of MySQL table 
clients_df = pd.read_sql_query('SELECT * FROM clients', connection)
clients_df.set_index('client_id', inplace = True)
clients_df

,name,address,city,state,phone
client_id,,,,,
1,Vinte,3 Nevada Parkway,Syracuse,NY,315-252-7305
2,Myworks,34267 Glendale Parkway,Huntington,WV,304-659-1170
3,Yadel,096 Pawling Parkway,San Francisco,CA,415-144-6037
4,Kwideo,81674 Westerfield Circle,Waco,TX,254-750-0784
5,Topiclounge,0863 Farmco Road,Portland,OR,971-888-9129
6,Lin,TS RD,Toronto,ON,971-888-9130

In [9]:
# Check data types in the dataframe
clients_df.dtypes

name       object
address    object
city       object
state      object
phone      object
dtype: object

### 3.2. invoices_df:

In [10]:
# Creat invoices_df Pandas dataframe and set index to the primary key of MySQL table 
invoices_df = pd.read_sql_query('SELECT * FROM invoices', connection)
invoices_df.set_index('invoice_id', inplace = True)
invoices_df.head()

,number,client_id,invoice_total,payment_total,invoice_date,due_date,payment_date
invoice_id,,,,,,,
1,91-953-3396,2,101.79,101.79,2019-03-09,2019-03-29,2019-03-09
2,03-898-6735,5,175.32,8.18,2019-06-11,2019-07-01,2019-02-12
3,20-228-0335,5,147.99,0.00,2019-07-31,2019-08-20,None
4,56-934-0748,3,152.21,76.11,2019-03-08,2019-03-28,2019-03-28
5,87-052-3121,5,169.36,0.00,2019-07-18,2019-08-07,None

In [11]:
# Returns tuple of shape (Rows, columns) of dataframe
invoices_df.shape

(17, 7)

In [12]:
# Check data types in the dataframe
invoices_df.dtypes

number            object
client_id          int64
invoice_total    float64
payment_total    float64
invoice_date      object
due_date          object
payment_date      object
dtype: object

### 3.3. payment_methods_df:

In [13]:
# Creat payment_methods_df Pandas dataframe and set index to the primary key of MySQL table 
payment_methods_df = pd.read_sql_query('SELECT * FROM payment_methods', connection)
payment_methods_df.set_index('payment_method_id', inplace = True)
payment_methods_df

                            name
payment_method_id
1                    Credit Card
2                           Cash
3                         PayPal
4                  Wire Transfer

In [14]:
# Check data types in the dataframe
payment_methods_df.dtypes

name    object
dtype: object

### 3.4. payments_df:

In [15]:
# Creat payments_df Pandas dataframe and set index to the primary key of MySQL table 
payments_df = pd.read_sql_query('SELECT * FROM payments', connection)
payments_df.set_index('payment_id', inplace = True)
payments_df

            client_id  invoice_id        date  amount  payment_method
payment_id
1                   5           2  2019-02-12    8.18               1
2                   1           6  2019-01-03   74.55               1
3                   3          11  2019-01-11    0.03               1
4                   5          13  2019-01-26   87.44               1
5                   3          15  2019-01-15   80.31               1
6                   3          17  2019-01-15   68.10               1
7                   5          18  2019-01-08   32.77               1
8                   5          18  2019-01-08   10.00               2

In [16]:
# Check data types in the dataframe
payments_df.dtypes

client_id           int64
invoice_id          int64
date               object
amount            float64
payment_method      int64
dtype: object

## 4. Run analytical SQL queries to extract subsets of information

### 4.1. Extract clients' payment information: payment date, name, amount, method, invoice amount and date

In [17]:
# Building SQL query
query1 = 'SELECT p.payment_id, p.date AS panyment_date, c.name AS client_name, c.phone, p.amount AS payment_total, \
        pm.name AS payment_method, i.invoice_total, i.invoice_date, i.due_date \
        FROM payments p \
        JOIN clients c \
        USING (client_id) \
        JOIN payment_methods pm \
        ON p.payment_method = pm.payment_method_id \
        JOIN invoices i \
        USING (invoice_id) \
        ORDER BY p.date;'

# Execute the query
result_proxy1 = connection.execute(query1)

# Fetch data from the result set
results1 = result_proxy1.fetchall()

# Print result1 
results1

[(2, datetime.date(2019, 1, 3), 'Vinte', '315-252-7305', Decimal('74.55'), 'Credit Card', Decimal('157.78'), datetime.date(2019, 1, 29), datetime.date(2019, 2, 18)),
 (8, datetime.date(2019, 1, 8), 'Topiclounge', '971-888-9129', Decimal('10.00'), 'Cash', Decimal('180.17'), datetime.date(2019, 5, 23), datetime.date(2019, 6, 12)),
 (7, datetime.date(2019, 1, 8), 'Topiclounge', '971-888-9129', Decimal('32.77'), 'Credit Card', Decimal('180.17'), datetime.date(2019, 5, 23), datetime.date(2019, 6, 12)),
 (3, datetime.date(2019, 1, 11), 'Yadel', '415-144-6037', Decimal('0.03'), 'Credit Card', Decimal('126.15'), datetime.date(2019, 1, 7), datetime.date(2019, 1, 27)),
 (6, datetime.date(2019, 1, 15), 'Yadel', '415-144-6037', Decimal('68.10'), 'Credit Card', Decimal('126.38'), datetime.date(2019, 7, 30), datetime.date(2019, 8, 19)),
 (5, datetime.date(2019, 1, 15), 'Yadel', '415-144-6037', Decimal('80.31'), 'Credit Card', Decimal('167.29'), datetime.date(2019, 11, 25), datetime.date(2019, 12, 15)),
 (4, datetime.date(2019, 1, 26), 'Topiclounge', '971-888-9129', Decimal('87.44'), 'Credit Card', Decimal('135.01'), datetime.date(2019, 6, 25), datetime.date(2019, 7, 15)),
 (1, datetime.date(2019, 2, 12), 'Topiclounge', '971-888-9129', Decimal('8.18'), 'Credit Card', Decimal('175.32'), datetime.date(2019, 6, 11), datetime.date(2019, 7, 1))]

In [18]:
# Convert SQL query result to Pandas dataframe to easily read and process
result1_df = pd.DataFrame(results1)

# Set dataframe columns name to the keys of MySQL table
result1_df.columns = result_proxy1.keys()

# Print result1 dataframe
result1_df

,payment_id,panyment_date,client_name,phone,payment_total,payment_method,invoice_total,invoice_date,due_date
0,2,2019-01-03,Vinte,315-252-7305,74.55,Credit Card,157.78,2019-01-29,2019-02-18
1,8,2019-01-08,Topiclounge,971-888-9129,10.00,Cash,180.17,2019-05-23,2019-06-12
2,7,2019-01-08,Topiclounge,971-888-9129,32.77,Credit Card,180.17,2019-05-23,2019-06-12
3,3,2019-01-11,Yadel,415-144-6037,0.03,Credit Card,126.15,2019-01-07,2019-01-27
4,6,2019-01-15,Yadel,415-144-6037,68.10,Credit Card,126.38,2019-07-30,2019-08-19
5,5,2019-01-15,Yadel,415-144-6037,80.31,Credit Card,167.29,2019-11-25,2019-12-15
6,4,2019-01-26,Topiclounge,971-888-9129,87.44,Credit Card,135.01,2019-06-25,2019-07-15
7,1,2019-02-12,Topiclounge,971-888-9129,8.18,Credit Card,175.32,2019-06-11,2019-07-01

### 4.2. Update clients' new payment amount and payment date using client_id

In [19]:
# Update client whoes ID is 3, new payment amount equal to half of invoice amount, payment date equal to due date. 
query2 = 'UPDATE invoices \
          SET payment_total = invoice_total * 0.5, payment_date = due_date \
          WHERE client_id = 3;'

result_proxy2 = connection.execute(query2)

In [20]:
# Print updated MySQL invoices table as dataframe
invoices_df = pd.read_sql_query('SELECT * FROM invoices', connection)
invoices_df.set_index('invoice_id', inplace = True)
invoices_df

,number,client_id,invoice_total,payment_total,invoice_date,due_date,payment_date
invoice_id,,,,,,,
1,91-953-3396,2,101.79,101.79,2019-03-09,2019-03-29,2019-03-09
2,03-898-6735,5,175.32,8.18,2019-06-11,2019-07-01,2019-02-12
3,20-228-0335,5,147.99,0.00,2019-07-31,2019-08-20,None
4,56-934-0748,3,152.21,76.11,2019-03-08,2019-03-28,2019-03-28
5,87-052-3121,5,169.36,0.00,2019-07-18,2019-08-07,None
6,75-587-6626,1,157.78,157.78,2019-01-29,2019-02-18,2019-01-29
7,68-093-9863,3,133.87,66.94,2019-09-04,2019-09-24,2019-09-24
8,78-145-1093,1,189.12,189.12,2019-05-20,2019-06-09,2019-05-20
9,77-593-0081,5,172.17,0.00,2019-07-09,2019-07-29,None
10,48-266-1517,1,159.50,159.50,2019-06-30,2019-07-20,2019-06-30
11,20-848-0181,3,126.15,63.08,2019-01-07,2019-01-27,2019-01-27
13,41-666-1035,5,135.01,87.44,2019-06-25,2019-07-15,2019-01-26
15,55-105-9605,3,167.29,83.65,2019-11-25,2019-12-15,2019-12-15
16,10-451-8824,1,162.02,162.02,2019-03-30,2019-04-19,2019-03-30
17,33-615-4694,3,126.38,63.19,2019-07-30,2019-08-19,2019-08-19
18,52-269-9803,5,180.17,42.77,2019-05-23,2019-06-12,2019-01-08
19,83-559-4105,1,134.47,134.47,2019-11-23,2019-12-13,2019-11-23

### 4.3. Update clients' new payment information using subqueries

In [21]:
# Update client whoes name is "Vinte" or "Myworks", new payment amount equal to invoice amount, payment date equal to invoice date. 
query3 = 'UPDATE invoices \
          SET payment_total = invoice_total, payment_date = invoice_date \
          WHERE client_id IN (SELECT client_id FROM clients WHERE name IN ("Vinte", "Myworks"));'

result_proxy3 = connection.execute(query3)

In [22]:
# Print updated MySQL invoices table as dataframe
invoices_df = pd.read_sql_query('SELECT * FROM invoices', connection)
invoices_df.set_index('invoice_id', inplace = True)
invoices_df

,number,client_id,invoice_total,payment_total,invoice_date,due_date,payment_date
invoice_id,,,,,,,
1,91-953-3396,2,101.79,101.79,2019-03-09,2019-03-29,2019-03-09
2,03-898-6735,5,175.32,8.18,2019-06-11,2019-07-01,2019-02-12
3,20-228-0335,5,147.99,0.00,2019-07-31,2019-08-20,None
4,56-934-0748,3,152.21,76.11,2019-03-08,2019-03-28,2019-03-28
5,87-052-3121,5,169.36,0.00,2019-07-18,2019-08-07,None
6,75-587-6626,1,157.78,157.78,2019-01-29,2019-02-18,2019-01-29
7,68-093-9863,3,133.87,66.94,2019-09-04,2019-09-24,2019-09-24
8,78-145-1093,1,189.12,189.12,2019-05-20,2019-06-09,2019-05-20
9,77-593-0081,5,172.17,0.00,2019-07-09,2019-07-29,None
10,48-266-1517,1,159.50,159.50,2019-06-30,2019-07-20,2019-06-30
11,20-848-0181,3,126.15,63.08,2019-01-07,2019-01-27,2019-01-27
13,41-666-1035,5,135.01,87.44,2019-06-25,2019-07-15,2019-01-26
15,55-105-9605,3,167.29,83.65,2019-11-25,2019-12-15,2019-12-15
16,10-451-8824,1,162.02,162.02,2019-03-30,2019-04-19,2019-03-30
17,33-615-4694,3,126.38,63.19,2019-07-30,2019-08-19,2019-08-19
18,52-269-9803,5,180.17,42.77,2019-05-23,2019-06-12,2019-01-08
19,83-559-4105,1,134.47,134.47,2019-11-23,2019-12-13,2019-11-23

### 4.4. Creat new clients' information

In [27]:
# Build query to create 2 new clients' records
query4 = 'INSERT INTO clients (client_id, name, address, city, state, phone) \
        VALUES (10, "Lily", "qps RD", "Toronto", "ON", "881-888-9130"), \
               (11, "Ha", "AS RD", "Toronto", "ON", "811-888-9130");'
    
result_proxy4 = connection.execute(query4)

In [28]:
# Print updated MySQL invoices table as dataframe
clients_df = pd.read_sql_query('SELECT * FROM clients', connection)
clients_df.set_index('client_id', inplace = True)
clients_df

,name,address,city,state,phone
client_id,,,,,
1,Vinte,3 Nevada Parkway,Syracuse,NY,315-252-7305
2,Myworks,34267 Glendale Parkway,Huntington,WV,304-659-1170
3,Yadel,096 Pawling Parkway,San Francisco,CA,415-144-6037
4,Kwideo,81674 Westerfield Circle,Waco,TX,254-750-0784
5,Topiclounge,0863 Farmco Road,Portland,OR,971-888-9129
6,Lin,TS RD,Toronto,ON,971-888-9130
8,Lin,TS RD,Toronto,ON,971-888-9130
9,Han,AS RD,Toronto,ON,811-888-9130
10,Lily,qps RD,Toronto,ON,881-888-9130
11,Ha,AS RD,Toronto,ON,811-888-9130

### 4.5. Delete new clients' information

In [29]:
# Build query to delect client's record, whose ID is 8, 9, 10
query5 = 'DELETE FROM clients WHERE client_id in (8, 9, 10);'
    
result_proxy5 = connection.execute(query5)

In [30]:
# Print updated MySQL invoices table as dataframe
clients_df = pd.read_sql_query('SELECT * FROM clients', connection)
clients_df.set_index('client_id', inplace = True)
clients_df

,name,address,city,state,phone
client_id,,,,,
1,Vinte,3 Nevada Parkway,Syracuse,NY,315-252-7305
2,Myworks,34267 Glendale Parkway,Huntington,WV,304-659-1170
3,Yadel,096 Pawling Parkway,San Francisco,CA,415-144-6037
4,Kwideo,81674 Westerfield Circle,Waco,TX,254-750-0784
5,Topiclounge,0863 Farmco Road,Portland,OR,971-888-9129
6,Lin,TS RD,Toronto,ON,971-888-9130
11,Ha,AS RD,Toronto,ON,811-888-9130